#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + attributes = {}
        id         = "ec7f735a-8cc7-4d29-818f-c83f406d5294"
        name       = "PHLAT Management"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT.module.client-roles.keycloak_role.ROLES["REG_ADMIN"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "8d123147-9bb8-46be-bf07-26ac295d693f"
        name       = "REG_ADMIN"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PHLAT.module.client-roles.keycloak_role.ROLES["REG_USER"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "bdc8b655-06c0-4359-8fef-698b6e56f3c5"
        name       = "REG_USER"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-phlat"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "e7c5b6c6-bc07-439f-8014-57817dca43dc"
        name       = "view-client-phlat"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.HEALTH-IDEAS-APEX.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "HEALTH-IDEAS-APEX"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "HealthIdeas Reporting Application - Oracle APEX"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "HEALTH-IDEAS-APEX"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "http://localhost:*",
          + "https://devsecure.healthideas.gov.bc.ca/*",
          + "https://localhost:*",
          + "https://uatsecure.healthideas.gov.bc.ca/*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HEALTH-IDEAS-APEX.keycloak_openid_user_attribute_protocol_mapper.idir_username will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "idir_username" {
      + add_to_access_token  = true
      + add_to_id_token      = true
      + add_to_userinfo      = true
      + aggregate_attributes = false
      + claim_name           = "idir_username"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "idir_username"
      + realm_id             = "moh_applications"
      + user_attribute       = "idir_username"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*